// https://stepik.org/lesson/53872/step/6?auth=login&unit=32085

/*
Масса одной молекулы воды приблизительно равна 3×10−23 грамм.  Масса одной капли воды приблизительно 0.05 гр. В одном гранёном стакане 
≈249.5 гр.  Напишите программу, которая вычисляет количество капель и молекул воды в N гранёных стаканах воды.

Входные данные:
Натуральное число N − количество стаканов воды.

Выходные данные:
Два числа.  Первое число − целое число количества капель в N стаканах воды. Второе число − количество молекул воды в N стаканах воды. Точность − 3 знака после запятой.

*/

#include <stdio.h>
#include <math.h>

const double m = 3e-23;
const 249.5 

int main () {
    int n;
    scanf("%d", &n);
    printf("");

    return 0;
}
